Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_85-The_Question_of_Maitreya-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: བཅོམ་ལྡན་འདས་ཡུལ་བརྒ་ན་ཆུ་སྲིན་བྱིས་པ་གསོད་ལྟ་བུའི་རི་འཇིགས་སུ་རུང་བའི་ནགས་རི་དགས་ཀྱི་ནགས་ན་དགེ་སློང་ལྔ་བརྒྱ་ཙམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པ་གནས་བརྟན་ཉན་ཐོས་ཆེན་པོ་ཤ་སྟག་ལ།
en: The Blessed One was staying in the Country of the Bhargas, on Mount Śuśumāra in a fearsome forest of wild animals, together with a great saṅgha of about 500 monks, eminent śrāvaka-elders who possessed clairvoyance.

source: འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽ་ཌི་ནྱ་དང་། ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་དང་། ཚེ་དང་ལྡན་པ་རླངས་པ་དང་། ཚེ་དང་ལྡན་པ་མིང་ཆེན་དང་། ཚེ་དང་ལྡན་པ་བཟང་ལྡན་དང་། ཚེ་དང་ལྡན་པ་དྲི་མ་མེད་དང་། ཚེ་དང་ལྡན་པ་གང་པོ་དང་། ཚེ་དང་ལྡན་པ་བ་ལང་བདག་དང་། ཚེ་དང་ལྡན་པ་རི་དགས་མགོ་དང་། ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ཆུ་ཀླུང་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ག་ཡ་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་བྱིན་པ་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་དོན་ཡོད་རྒྱལ་པོ་དང་། ཚེ་དང་ལྡན་པ་བློ་གྲོས་བཟང་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་རི་རྒྱལ་དང་། ཚེ་དང་ལྡན་པ་དགའ་བོ་དང་། ཚེ་དང་ལྡན་པ་ཉེ་དགའ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་དང་། དེ་དག་ལ་སོགས་པ་
en: These included the omniscient venerable Kauṇḍinya, and the venerables Aśvajit, Vaṣpa, Mahānāman, Bhadrika, Vimala, Pūrṇa, Gavāṃpati, Mṛgaśiras, Uruvilva Kāśyapa, Nadīkāśyapa, Gayākāśyapa, Jaṅghā Kāśyapa, Mahākāśyapa, Amogharāja, Sumati, Śāriputra, the eminent Maudgalyāyana, Parvatarāja, Nanda, Upananda, Ānanda, Rāhula, and so on

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ
en: At that time, the bodhisattva Maitreya was present in that very retinue.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: So the bodhisattva mahāsattva Maitreya asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One answered the bodhisattva mahāsattva Maitreya,

source: །བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཅིག་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: “Maitreya, if bodhisattvas possess one single quality, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: ཆོས་གཅིག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ཏེ།
en: What is that single quality? Having the altruistic intention of excellent bodhicitta.

source: ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ཏེ།
en: Having the altruistic intention of excellent bodhicitta.

source: བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཅིག་པོ་དེ་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Maitreya, if bodhisattvas possess this single quality, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: །བྱམས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཉིས་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: “Furthermore, Maitreya, if bodhisattvas possess two qualities, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: །བྱམས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གསུམ་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: “Furthermore, Maitreya, if bodhisattvas possess three qualities, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ལ་གནས་པ་ཡིན། ཆོས་ཐམས་ཅད་ལ་སོམ་ཉི་མེད་པ་ཡིན།
en: What four qualities? Observing moral conduct, having no doubt about the whole of the Dharma,

source: དགོན་པ་ལ་མངོན་པར་དགའ་བ་ཡིན། ཡང་དག་པར་ཞུགས་ཤིང་ཡང་དག་པར་བླངས་པ་ལས་མི་གཡོ་བ་ཡིན་ཏེ།
en: delighting in seclusion, and not wavering from the undertaking to which they have committed themselves

source: །བྱམས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བདུན་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: “Furthermore, Maitreya, if bodhisattvas possess seven qualities, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བདུན་པོ་དེ་དག་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Maitreya, if bodhisattvas possess these seven qualities, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: །བྱམས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: “Furthermore, Maitreya, if bodhisattvas possess eight qualities, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: བྱམས་པ་ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Maitreya, if bodhisattvas possess these eight qualities, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: །བྱམས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དགུ་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: “Furthermore, Maitreya, if bodhisattvas possess nine qualities, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: །བྱམས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: “Furthermore, Maitreya, if bodhisattvas possess ten qualities, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Maitreya, if bodhisattvas possess these ten qualities, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: །རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ནས་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་བསྒྲུབས་ནས་གནས་པ་སྟེ།
en: After they have transcended the sphere of neither perception nor non-perception in all aspects, they then accomplish the cessation of perception and feeling and maintain it.

source: བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དགུ་པོ་དེ་དག་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Maitreya, if bodhisattvas possess these nine qualities, they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེ་དེ་བཞིན་ནོ།
en: “Exactly, Ānanda,” replied the Blessed One.

source: །ཇི་སྐད་སྨྲས་པ་བཞིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཤིན་ཏུ་རྣམ་པར་ངེས་པའི་ཚིག་གིས་ཆོས་སྟོན་པ་ནས་རྗེས་སུ་དྲན་པའི་ཚིག་གི་བར་གྱིས་ཆོས་སྟོན་པ་ནི་ངོ་མཚར་ཏོ།
en: “It is just as you have said—it is wonderful that the bodhisattva Maitreya is so supremely eloquent, that the bodhisattva Maitreya teaches the Dharma with such words of certainty, and all of what you said, up to his teaching the Dharma with such memorable words.

source: །ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ནི་ད་ལྟར་ང་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་དག་གིས་བསྟོད་པར་ཡང་མ་ཟད་དེ།
en: Ānanda, this is not the first time that the bodhisattva Maitreya has praised me with such fitting verses.

source: ཞལ་ཟླ་བའི་དཀྱིལ་འཁོར་ལྟར་ཞི་བ།
en: His face was as calm as the sphere of the moon

source: ཉི་མའི་དཀྱིལ་འཁོར་ལྟར་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེ་བ།
en: and radiantly clear and brilliant like the sphere of the sun.

source: །གལ་ཏེ་བདག་ཀྱང་མ་འོངས་པའི་དུས་ན་འདི་ལྟ་བུའི་ལུས་དང་ལྡན་པར་གྱུར་ཏེ།
en: ‘If in the future I shall come to possess such a body,

source: ཁ་དོག་དང་། གཟི་བརྗིད་དང་། དཔལ་དང་། མཚན་རྣམས་ཀྱིས་འབར་ཞིང་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེར་འགྱུར་ཞེ་ན། དེ་བཞིན་གཤེགས་པའི་ཞབས་བདག་གི་ལུས་ལ་རེག་པར་གྱུར་ཅིག་སྙམ་མོ།
en: blazing like this in complexion, magnificence, splendor, marks of buddhahood, and with clear, brilliant radiance, may the Tathāgata touch me with his foot.’

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པའི་ཕྱིར་རོ།
en: Because he is a bodhisattva mahāsattva who has accepted the fact that all phenomena are unproduced.

source: །དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་གིས་ལྷའི་མིག་དང་། ལྷའི་རྣ་བ་དང་། ཕ་རོལ་གྱི་སེམས་ཤེས་པ་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱ་བའི་ཤེས་པ་ཐོབ་བོ། །རྫུ་འཕྲུལ་ཡང་མངོན་པར་བསྒྲུབས་སོ།
en: “At that very moment, the brahmin boy Bhadraśuddha obtained the knowledge of the divine eye, knowledge of the divine ear, knowledge of the thoughts of others, and knowledge recollecting his past lives, and also accomplished miraculous powers.

source: །དེས་དེ་བཞིན་གཤེགས་པ་སྣང་བས་རྣམ་པར་རོལ་པའི་མངོན་པར་ཤེས་པའི་སྤྱན་སྔར་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་དག་གིས་ཀྱང་མངོན་པར་བསྟོད་དོ།
en: In the presence of the Tathāgata Jyoti­vikrīḍitābhijña he spoke the following fitting verses of praise:

source: འགྲོ་བ་ཀུན་ན་རྫོགས་པའི་སངས་རྒྱས་མངོན་པར་འཕགས། །རྣམ་པར་འདྲེན་པ་རང་བྱུང་ཁྱོད་ལ་བདག་ཕྱག་འཚལ།
en: The perfect Buddha is supreme in all realms of existence. O great self-arisen guide, to you I pay homage.

source: །དཔེར་ན་བར་སྣང་ན་ནི་ཉི་མ་ལྷན་ནེ་ལྟར། །ཕྱོགས་དང་ཕྱོགས་མཚམས་ཀུན་གྱི་འཇིག་རྟེན་ཁམས་རྣམས་ན།
en: “ ‘Just as the bright sun in the sky, In all worldly realms of the cardinal and intermediate directions,

source: །འཕགས་པ་ངེས་པར་འབྱིན་པའི་ལམ་ནི་རབ་ཏུ་བརྙེས།
en: Noble One, you discovered the path of deliverance;

source: ། ནོར་རྣམས་ཀུན་དང་ལྡན་ཞིང་ཡོན་ཏན་རྣམས་ཀྱིས་ཕྱུག
en: Possessing every wealth, rich in qualities,

source: །བསམ་པ་བཞིན་དུ་འཕགས་པའི་ནོར་རྣམས་བཀོད་པ་མཛད།
en: You array the wealth of a noble one as you please.

source: །ས་དང་མཚུངས་ཤིང་སྦྱིན་པའི་གནས་གྱུར་མཚུངས་མ་མཆིས།
en: ‘You are comparable to the earth, and without equal as a recipient of offerings.

source: །ཀུན་དགའ་བོ་དེ་ཚུན་ཆད་བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་དེའི་རྫུ་འཕྲུལ་རྣམས་སམ། མངོན་པར་ཤེས་པ་རྣམས་ཡོངས་སུ་ཉམས་པར་མ་གྱུར་ཏོ།
en: “Ānanda, this does not yet exhaust the miraculous displays and supernormal powers of the brahmin boy Bhadraśuddha.

source: །ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཡིད་གཉིས་ཟ་འམ། ཐེ་ཚོམ་ཟ་ན་དེ་ལྟར་མི་བལྟའོ།
en: “Ānanda, if you wonder whether the brahmin boy Bhadraśuddha was then, at that time, someone else, or you are of two minds about it, or doubtful, do not see him so.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་བས་རྣམ་པར་རོལ་པའི་མངོན་པར་ཤེས་པ་དེ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: who uttered these verses of praise to the Tathāgata, the Arhat, the perfectly enlightened Buddha Jyoti­vikrīḍitābhijña.

source: །ཀུན་དགའ་བོ་ཆོས་བཅུ་པོ་འདི་དག་གིས་ང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Ānanda, it was by means of ten qualities that I quickly accomplished supreme, perfect enlightenment and became a buddha.

source: ཀུན་དགའ་བོ་ཆོས་བཅུ་པོ་དེ་དག་གིས་ང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Ānanda, it was by means of those ten qualities that I quickly realized supreme, perfect enlightenment and became a buddha.

source: །ཀུན་དགའ་བོ་གཞན་ཡང་ང་ཆོས་བཅུས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: “Ānanda, it was also by means of a further ten qualities that I quickly accomplished supreme, perfect enlightenment and became a buddha.

source: བཅུ་གང་ཞེ་ན། ཀུན་དགའ་བོ་ང་ཚུལ་ཁྲིམས་ཀྱི་ཡོན་ཏན་གྱི་ཆོས་ལ་གནས་ཏེ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: What ten qualities? Ānanda, I adhered to the teaching of the qualities of moral conduct, and so I quickly realized supreme, perfect enlightenment and became a buddha.

source: །ཀུན་དགའ་བོ་ང་བཟོད་པའི་སྟོབས་དང་ལྡན་པས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Ānanda, I possessed the power of patience, and so I quickly realized supreme, perfect enlightenment and became a buddha.

source: །ཀུན་དགའ་བོ་ང་བརྩོན་འགྲུས་འབར་བ་བརྩམས་པས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Ānanda, I applied ardent diligence, and so I quickly realized supreme, perfect enlightenment and became a buddha.

source: །ཀུན་དགའ་བོ་ང་བསམ་གཏན་གྱི་ཡོན་ཏན་ལ་གནས་ཏེ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Ānanda, I adhered to the qualities of meditation, and so I quickly realized supreme, perfect enlightenment and became a buddha.

source: གྲོང་བར་དུ་ཕྱིན་པ་དང་གནོད་པས་ཉེན་ཅིང་སྡུག་བསྔལ་ལ་ནད་ཚབས་ཆེན་པོས་བཏབ་པའི་མི་ཞིག་མཐོང་ངོ་།
en: when he saw between the villages a man afflicted with suffering and seriously ill.

source: །མཐོང་ནས་ཀྱང་དེ་སྙིང་རྗེ་བར་གྱུར་ཏེ།
en: At this sight, he felt compassion,

source: ། ཀུན་དགའ་བོ་མི་དེས་དེ་འཐུངས་མ་ཐག་ཏུ་མི་དེའི་ནད་སོས་པར་གྱུར་ཏོ།
en: Ānanda, as soon as the man drank it, his illness was cured.

source: །ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་ནོར་ཐམས་ཅད་སྦྱིན་པར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཡིད་གཉིས་སམ། ཐེ་ཚོམ་ཟ་ན་དེ་ལྟར་མི་བལྟའོ།
en: Ānanda, if you wonder whether Prince Giver of All Wealth was then, at that time, someone else, or you are of two minds about it, or doubtful, do not see him so.

source: །དེས་སྨྲས་པ། ཀྱེ་མི་ཁྱོད་ཀྱི་ནད་ཅིས་ཞི་བར་འགྱུར། ཁྱོད་ལ་ཅི་སྦྱིན། དེས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “ ‘What will assuage your illness, my good man?’ asked the prince. ‘What shall I give you?’

source: གྲོང་བར་དུ་ཕྱིན་པ་དང་། མི་མིག་མེད་པ་ལོང་བ། དབུལ་པོ། བཀྲེན་པ། སློངས་མོ་བྱེད་པ་ཞིག་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེ་སྙིང་རྗེ་བར་གྱུར་ཏོ།
en: when between the villages he saw a poor, eyeless blind man, a destitute beggar. At this sight, he felt compassion.

source: །ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཟླ་འོད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཡིད་གཉིས་སམ་ཐེ་ཚོམ་ཟ་ན་དེ་ལྟར་མི་བལྟའོ།
en: Ānanda, if you wonder whether King Candraprabha was then, at that time , someone else, or you are of two minds about it, or doubtful, do not see him so.

source: །ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་ནི་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ལག་པ་ཡོངས་སུ་བཏང་བ་མ་བྱས། རྐང་པ་ཡོངས་སུ་བཏང་བ་མ་བྱས། རྐང་ཡོངས་སུ་བཏང་བ་མ་བྱས།
en: Ānanda, when the bodhisattva mahāsattva Maitreya was formerly engaged in the conduct of a bodhisattva he did not let go of his arms, legs, or marrow.

source: ཆུང་མ་ཕངས་པ་ཡོངས་སུ་བཏང་བ་མ་བྱས། བུ་ཕངས་པ་ཡོངས་སུ་བཏང་བ་མ་བྱས། གྲོང་དང་། གྲོང་རྡལ་དང་། གྲོང་ཁྱེར་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཕངས་པ་ཡོངས་སུ་བཏང་བ་མ་བྱས་ཏེ།
en: He did not renounce and let go of his spouse, or his child, village, town, city, royal palace, or retinue.

source: །ཀུན་དགའ་བོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ།
en: “Ānanda, when formerly the bodhisattva mahāsattva Maitreya engaged in the conduct of a bodhisattva,

source: རློམ་སེམས་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱིས།
en: And conduct that is without arrogance,

source: དེའི་འོག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་སྨོན་ལམ་གྱི་དབང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: After that, the bodhisattva mahāsattva Maitreya, due to the power of his prayer, will perfectly accomplish supreme, perfect, and completely enlightened buddhahood.

source: འདོད་ཆགས་བདོ་བ་དང་། ཞེ་སྡང་བདོ་བ་དང་། གཏི་མུག་བདོ་བ་དང་།
en: Desire, anger, and ignorance will all increase.

source: དུས་ཡ་ང་བ་འདི་ལྟ་བུ་ལ་གནས་ནས་ཀུན་དགའ་བོ་ངས་སྙིང་རྗེ་ཆེན་པོ་མདུན་དུ་བྱས་ཏེ།
en: Having lived in such a terrible epoch, Ānanda, I have kindled great compassion.

source: །ཀུན་དགའ་བོ་ང་ལ་ཆད་པར་སྨྲ་བ་ཡིན་ནོ་ཞེས་ཀྱང་ཟེར་རོ། །རྟག་པར་སྨྲ་བ་ཡིན་ནོ་ཞེས་ཀྱང་ཟེར་རོ།
en: Ānanda, it is even said that I am a nihilist, or that I am an eternalist.

source: སངས་རྒྱས་སུ་གྱུར་ཀྱང་མཛེས་ལྡན་མ་དང་ཞེས་བྱ་བ་ལྟ་བུ་འཁྲིག་པའི་ཆོས་དང་ལྡན་པས་ང་ལ་སྐུར་པ་ཡང་བཏབ་བོ།
en: Although I am a buddha, I am denigrated as cohabiting with so-called ‘beautiful women’ and the like.

source: །བཅོམ་ལྡན་འདས་སེམས་ཅན་དེ་ལྟ་བུ་དེ་དག་ལ་ཆོས་སྟོན་པར་མཛད་པ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་དུལ་བ་འདུལ་བ། ཁུར་ཆེན་པོ་བསྣམས་པ། དཀའ་བ་མཛད་པ་ལགས་སོ།
en: “The Blessed One who teaches the Dharma to such sentient beings, converting those not previously converted by the Tathāgata, the Arhat, the perfectly enlightened Buddha, has taken on a great burden, and undergone hardships.

source: །ཀུན་དགའ་བོ་དེ་དེ་བཞིན་ནོ། །ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: “Exactly, Ānanda. It is just as you have said.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་དུལ་བ་འདུལ་བ། ཁུར་ཆེན་པོ་བསྣམས་པ།
en: Ānanda, the Tathāgata, the Arhat, the perfectly enlightened Buddha has tamed those not previously tamed, taken on a great burden,

source: དགེ་བའི་ཆོས་ཐམས་ཅད་དང་ལྡན་པ་གང་དག་སེམས་ཅན་དེ་ལྟ་བུ་དག་ལ་ཆོས་སྟོན་པ་ནི་དཀའ་བ་མཛད་པའོ།
en: and himself endowed with every virtuous quality, undergone hardship by teaching the Dharma to such sentient beings.

source: །བྱམས་པས་ཞུས་པ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག
en: You should also remember it as ‘The Question of Maitreya.

source: དགེ་སློང་ལྔ་བརྒྱ་པོ་དེ་དག་དང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: together with the five hundred monks and the entire retinue, as well as the worlds of gods and men, demi-gods and gandharvas, rejoiced and praised the Blessed One’s words.

source: །འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་བྱམས་པས་ཞུས་པའི་ལེའུ་ཞེས་བྱ་སྟེ་བཞི་བཅུ་རྩ་གཅིག་པ་རྫོགས་སོ།།
en: This concludes the “Section of the Question of Maitreya,” the forty-first section of The Noble Dharma Discourse, the Great Heap of Jewels, in one hundred thousand sections.

source: །།རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། སུ་རེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: This text was translated, edited, and finalized by the Indian scholars Jinamitra and Surendrabodhi, together with the chief editor and translator Yeshé Dé.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus have I heard at one time.

source: །བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པ་ཁྲི་དང་ཡང་ཐབས་ཅིག་ལ་
en: Maitreya and 10,000 other bodhisattva mahāsattvas endowed with clairvoyance had also assembled there.

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་འཕེལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་དང་། བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བརྟན་དང་། བློ་གྲོས་ཡངས་པ་དང་། སྤོབས་པ་བརྩེགས་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། མཐུ་ཆེན་ཐོབ་དང་། ཏོག་དཔལ་དང་། འཇམ་དཔལ་དང་། མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པ་དང་། དམིགས་པ་མེད་པ་ཡིད་ལ་བྱེད་པ་དང་། དད་ལྡན་དང་། རིན་པོ་ཆེའི་ཏོག་དང་། དབང་པོའི་ལྷ་དང་། ཆུ་ལྷ་དང་། སྒྲ་དབྱངས་སྙན་དང་། ཞིང་རྣམ་པར་སྦྱོང་དང་། ལྷུན་པོ་བརྩེགས་དང་། སྤོབས་པ་ཕུན་སུམ་ཚོགས་དང་། དབང་པོའི་དཔལ་དང་། ས་འཛིན་དང་། སེམས་ཅན་དམྱལ་བ་སྐེམས་དང་། ངན་སོང་སྤོང་དང་། རིན་ཆེན་ཟེ་བ་ཅན་དང་དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་དང་ཐབས་ཅིག་སྟེ།
en: These included the bodhisattvas Vardhamāna­mati, Sumati, Sthiramati, Viśālamati, Pratibhāna­kūṭa, Avalokiteśvara, Mahā­sthāma­prāpta, Kusumaśrī, Mañjuśrī, Abhi­jñā­puṣpa­supari­pūrṇa, An­upalambha­manasi­kāra, Prasādavat, Ratnaketu, Indradeva, Varuṇadeva, Mṛdusvara, Kṣetra­viśodhana, Merukūṭa, Prati­bhāna­saṃpad, Indraśrī, Nimiṃdhara, Scourer of the Hell-Dwellers, Abandoner of Unfavorable Rebirths, Ratnakesarin, and others.

source: དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་ཏོ།
en: The Blessed One, surrounded by this retinue of many hundreds of thousands, surveyed those before him, and taught the Dharma.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཆེན་པོ་དེ་འདུས་པར་རིག་ནས་སྟན་ལས་ལངས་ཏེ།
en: He surveyed the great assembly of bodhisattvas, rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: draped his shawl over one shoulder, set his right knee on the ground,

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: and paid homage with palms joined toward the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He asked the Blessed One,

source: །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ།
en: “Would the Blessed One, if he has time, please answer a certain question that I would like to put to the Tathāgata, the Arhat, the completely and perfectly enlightened Buddha?”

source: །བྱམས་པ་དྲི་བ་ལུང་བསྟན་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པས་རྟག་ཏུ་སྐབས་ཕྱེས།
en: Maitreya, the Tathāgata always has time to answer such questions.

source: བྱམས་པ་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་། དྲིས་པ་དེ་དང་དེའི་ལུང་བསྟན་པས། སེམས་རངས་པར་བྱའོ།
en: Ask whatever you wish, Maitreya. What I shall say in response to your question will cause you to rejoice.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དུ་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་སུག་པར་མཆི་བར་མི་འགྱུར་ལ།
en: Blessed One, how many qualities do bodhisattvas need to possess in order to abandon all evil rebirths and not fall into the clutches of sinful associates,

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལགས།
en: but swiftly realize supreme, perfect enlightenment and become a buddha?

source: །བྱམས་པ་ཁྱོད་ནི་འདི་ལྟར་སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ།
en: Maitreya, you have served the victorious ones of the past,

source: དགེ་བའི་རྩ་བ་བསྐྱེད་པ།
en: cultivated the roots of virtue,

source: ཚེ་རབས་དྲན་པ།
en: recalled your past lives,

source: སྤོབས་པ་ཐོབ་པ།
en: acquired eloquence,

source: ཡུན་རིང་པོ་ནས་ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་སྟེ།
en: and for a long time, lived chastely.

source: བྱམས་པ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་།
en: Maitreya, you work for the benefit of many people,

source: སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་།
en: bring happiness to many people,

source: འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་།
en: and are compassionate toward the world.

source: སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་། ཕན་པ་དང་། བདེ་བ་དང་།
en: You live to bring welfare, benefit, and well-being to ordinary beings, gods, and men,

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་ད་ལྟར་གྱི་དང་། མ་འོངས་པ་རྣམས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ཞུགས་ནས་
en: and to assist the noble sons and daughters, present and future, who belong to the vehicle of the bodhisattvas.
